Tsung/googletrends.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/home/ec2-user/opt/tsung-1.5.0/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">

	<!-- Client side setup -->
	<clients>
		<client host="localhost" use_controller_vm="true" maxusers='15000'/>
	</clients>

	<!-- Server side setup -->
	<servers>
		<server host="google.com" port="80" type="tcp"></server>
	</servers>
	<load>
		<arrivalphase phase="1" duration="30" unit="second">
			<users arrivalrate="1" unit="second"></users>
		</arrivalphase>
		<arrivalphase phase="2" duration="30" unit="second">
			<users arrivalrate="2" unit="second"></users>
		</arrivalphase>
		<arrivalphase phase="3" duration="30" unit="second">
			<users arrivalrate="3" unit="second"></users>
		</arrivalphase>
		<arrivalphase phase="4" duration="30" unit="second">
			<users arrivalrate="4" unit="second"></users>
		</arrivalphase>
		<arrivalphase phase="5" duration="30" unit="second">
			<users arrivalrate="5" unit="second"></users>
		</arrivalphase>
		<arrivalphase phase="6" duration="30" unit="second">
			<users arrivalrate="6" unit="second"></users>
		</arrivalphase>
		<arrivalphase phase="7" duration="30" unit="second">
			<users arrivalrate="7" unit="second"></users>
		</arrivalphase>
		<arrivalphase phase="8" duration="30" unit="second">
			<users arrivalrate="8" unit="second"></users>
		</arrivalphase>
		<arrivalphase phase="9" duration="30" unit="second">
			<users arrivalrate="9" unit="second"></users>
		</arrivalphase>
		<arrivalphase phase="10" duration="30" unit="second">
			<users arrivalrate="10" unit="second"></users>
		</arrivalphase>

	</load>
	<options>
		<!-- Set connection timeout to 2 seconds -->
		<option name="global_ack_timeout" value="2000"></option>
		<option type="ts_http" name="user_agent">
			<user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
		</option>
	</options>
	<sessions>
		<session name="http-example" probability="100" type="ts_http">

			<!-- Hit the homepage -->
			<transaction name = "debt">
				<request>
					<http url='/trends/fetchComponent?q=asdf&cid=TIMESERIES_GRAPH_0&export=3&date=today+3-m&geo=US' version='1.1' method='GET'>
						<add_cookie key="NID" value="74=yAj0VJDtq0QqUNqtk5spmks4lFeLIfa7aHqeS64DqegW7IfVRhG-C_sZhTeHenN-PcTllzpUTFGTCOAt5E9efXG0-GEodhb19-sc5W34K9L6R-tv70RX6AOFxg6r9UyCcmlel0kgPKXVtt5z3JbQgLa9Emgkff4k0q1c3ofmAJ-m6QkUQ7HA-cruzi-kWOmohli2"/>
					</http>
				</request>
			</transaction>

		</session>
	</sessions>
</tsung>