Tsung/tradertests.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/home/ec2-user/opt/tsung-1.5.0/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="54.152.35.97" port="80" type="tcp"></server>
  </servers>

  <load>
    <arrivalphase phase="1" duration="1" unit="minute">
      <users arrivalrate="8" unit="second"></users>
    </arrivalphase>

	<arrivalphase phase="2" duration="1" unit="minute">
      <users arrivalrate="12" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="3" duration="1" unit="minute">
      <users arrivalrate="16" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="4" duration="1" unit="minute">
      <users arrivalrate="20" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="5" duration="1" unit="minute">
      <users arrivalrate="24" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="6" duration="1" unit="minute">
      <users arrivalrate="28" unit="second"></users>
    </arrivalphase>

  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="http-example" probability="100" type="ts_http">

      <!-- Hit the homepage -->
      <transaction name = "index">
        <request>
          <!--           <dyn_variable name="home_css" re="&#x22;(\/assets/[^&#x22;]*).css&#x22;"/>
                    <dyn_variable name="home_js" re="&#x22;(\/assets/[^&#x22;]*).js&#x22;"/> -->
          <http url='/' version='1.1' method='GET'></http>
        </request>
        <request  subst="true">
          <http url='/assets/application-872c0659e84dc9ecc0cb1eb38ac394282dcb0fe9a81e2d3530854ca2115eacc2.css' version='1.1' method='GET'></http>
        </request>
        <request  subst="true">
          <http url='/assets/application-5432468b7d0ffd0cd5115efefd45154d78ab4f3a3803f4b3e53e77189d4f9152.js' version='1.1' method='GET'></http>
        </request>
        <request>
          <http url='/assets/bootstrap/glyphicons-halflings-regular-fe185d11a49676890d47bb783312a0cda5a44c4039214094e7957b4c040ef11c.woff2' version='1.1' method='GET'></http>
        </request>

      </transaction>

      <!-- Wait 1 seconds -->
      <thinktime value="1" random="true"></thinktime>


      <!--Sign Up and login-->
      <transaction name="signup">
        <request>
          <http url='/' version='1.1' method='GET'></http>
        </request>
        <request>
          <dyn_variable name="authenticity_token"></dyn_variable>
          <http url="/users/sign_up" version='1.1' method='GET'></http>
        </request>

        <setdynvars sourcetype="random_number" start="1000" end="9999999">
          <var name="random_user_name" />
        </setdynvars>
        <setdynvars sourcetype="random_string" length="13">
          <var name="random_email_name" />
        </setdynvars>

        <request subst="true">
          <http url="/users" method="POST" version="1.1"
                contents="utf8=%E2%9C%93&amp;authenticity_token=%%_authenticity_token%%&amp;user%5Bemail%5D=%%_random_email_name%%@gmail.com&amp;user%5Bpassword%5D=%%_random_email_name%%&amp;user%5Bpassword_confirmation%5D=%%_random_email_name%%&amp;commit=Sign+up">
          </http>
        </request>
      </transaction>



      <!-- Wait 1 seconds -->
      <thinktime value="1" random="true"></thinktime>


      <!-- Hit Google Trends Strategy page -->
      <transaction name = "google_trends_home">
        <request>
          <dyn_variable name="gts_css" re="&#x22;(\/assets/[^&#x22;]*).css&#x22;"/>
          <dyn_variable name="gts_js" re="&#x22;(\/assets/[^&#x22;]*).js&#x22;"/>
          <http url='/google_trends_strategy/index' version='1.1' method='GET'></http>
        </request>
        <request  subst="true">
          <http url='/assets/application-872c0659e84dc9ecc0cb1eb38ac394282dcb0fe9a81e2d3530854ca2115eacc2.css' version='1.1' method='GET'></http>
        </request>
        <request  subst="true">
          <http url='/assets/application-5432468b7d0ffd0cd5115efefd45154d78ab4f3a3803f4b3e53e77189d4f9152.js' version='1.1' method='GET'></http>
        </request>
        <request>
          <http url='/assets/bootstrap/glyphicons-halflings-regular-fe185d11a49676890d47bb783312a0cda5a44c4039214094e7957b4c040ef11c.woff2' version='1.1' method='GET'></http>
        </request>
      </transaction>

      <!-- Wait 2 seconds -->
      <thinktime value="2" random="true"></thinktime>

      <!-- do random GTS -->
      <transaction name = "google_trends_query">
        <request>
          <http url='/random_gt_query/gts' version='1.1' method='GET'></http>
        </request>
        <request  subst="true">
          <http url='/assets/application-872c0659e84dc9ecc0cb1eb38ac394282dcb0fe9a81e2d3530854ca2115eacc2.css' version='1.1' method='GET'></http>
        </request>
        <request  subst="true">
          <http url='/assets/application-5432468b7d0ffd0cd5115efefd45154d78ab4f3a3803f4b3e53e77189d4f9152.js' version='1.1' method='GET'></http>
        </request>
        <request>
          <http url='/assets/bootstrap/glyphicons-halflings-regular-fe185d11a49676890d47bb783312a0cda5a44c4039214094e7957b4c040ef11c.woff2' version='1.1' method='GET'></http>
        </request>
      </transaction>

      <!-- Wait 2 seconds -->
      <thinktime value="2" random="true"></thinktime>

      <!-- Hit Volume page -->
      <transaction name = "volume_home">
        <request>
          <http url='/volume_chart/index' version='1.1' method='GET'></http>
        </request>
        <request  subst="true">
          <http url='/assets/application-872c0659e84dc9ecc0cb1eb38ac394282dcb0fe9a81e2d3530854ca2115eacc2.css' version='1.1' method='GET'></http>
        </request>
        <request  subst="true">
          <http url='/assets/application-5432468b7d0ffd0cd5115efefd45154d78ab4f3a3803f4b3e53e77189d4f9152.js' version='1.1' method='GET'></http>
        </request>
        <request>
          <http url='/assets/bootstrap/glyphicons-halflings-regular-fe185d11a49676890d47bb783312a0cda5a44c4039214094e7957b4c040ef11c.woff2' version='1.1' method='GET'></http>
        </request>
      </transaction>

      <!-- Wait 2 seconds -->
      <thinktime value="2" random="true"></thinktime>

      <!-- do random volume strategy -->
      <transaction name = "volume_query">
        <request>
          <!-- <http url='/volume_chart/show?trend_term=debt+&amp;stock_symbol=aapl' version='1.1' method='POST'></http> -->
          <http url='/random_gt_query/volume' version='1.1' method='GET'></http>
        </request>
        <request  subst="true">
          <http url='/assets/application-872c0659e84dc9ecc0cb1eb38ac394282dcb0fe9a81e2d3530854ca2115eacc2.css' version='1.1' method='GET'></http>
        </request>
        <request  subst="true">
          <http url='/assets/application-5432468b7d0ffd0cd5115efefd45154d78ab4f3a3803f4b3e53e77189d4f9152.js' version='1.1' method='GET'></http>
        </request>
        <request>
          <http url='/assets/bootstrap/glyphicons-halflings-regular-fe185d11a49676890d47bb783312a0cda5a44c4039214094e7957b4c040ef11c.woff2' version='1.1' method='GET'></http>
        </request>
      </transaction>




      <transaction name="investment">
        <request>
          <http url="/investments" version='1.1' method='GET'></http>
        </request>
        <request>
          <http url='/investments/new' version='1.1' method='GET'></http>
        </request>

        <request subst="true">
          <http url='/investments' version='1.1' method='POST'
                contents='utf8=%E2%9C%93&amp;investment%5BstockName%5D=Yahoo&amp;investment%5Bticker%5D=YHOO&amp;investment%5Bquantity%5D=2&amp;commit=Create+Investment' ></http>
        </request>

      </transaction>


    </session>
  </sessions>
</tsung>